# SectionCoarserScalePulldownMetric Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SectionCoarserScalePulldownMetric Property
ParameterTypeId Class See Also
---
"Hide at scales coarser than"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SectionCoarserScalePulldownMetric { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SectionCoarserScalePulldownMetric As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SectionCoarserScalePulldownMetric {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace